from typing import Tuple
from telebot.handler_backends import State, StatesGroup


cities = {
    'Москва': {'lat': '55.833333', 'lon': '37.616667'},
    'Пенза': {'lat': '53.22729', 'lon': '45'},
    'Абакан': {'lat': '53.7156', 'lon': '91.4292'},
    'Санкт-Петербург': {'lat': '59.9386', 'lon': '30.3141'},
    'Альметьевск': {'lat': '54.9044', 'lon': '52.3154'},
    'Ангарск': {'lat': '52.5367', 'lon': '103.886'},
    'Арзамас': {'lat': '55.39646', 'lon': '43.82992'},
    'Армавир': {'lat': '44.9892', 'lon': '41.1234'},
    'Артем': {'lat': '43.3595', 'lon': '132.189'},
    'Архангельск': {'lat': '64.5401', 'lon': '40.5433'},
    'Астрахань': {'lat': '46.3497', 'lon': '48.0408'},
    'Ачинск': {'lat': '56.2694', 'lon': '90.4993'},
    'Балаково': {'lat': '52.0278', 'lon': '47.8007'},
    'Балашиха': {'lat': '55.8094', 'lon': '37.9581'},
    'Барнаул': {'lat': '53.3606', 'lon': '83.7636'},
    'Батайск': {'lat': '47.1398', 'lon': '39.7518'},
    'Белгород': {'lat': '50.6107', 'lon': '36.5802'},
    'Бердск': {'lat': '54.7551', 'lon': '83.0967'},
    'Березники': {'lat': '59.4091', 'lon': '56.8204'},
    'Бийск': {'lat': '52.5364', 'lon': '85.2072'},
    'Благовещенск': {'lat': '50.2796', 'lon': '127.54'},
    'Братск': {'lat': '56.1325', 'lon': '101.614'},
    'Брянск': {'lat': '53.2521', 'lon': '34.3717'},
    'Великий Новгород': {'lat': '46.3497', 'lon': '48.0408'},
    'Владивосток': {'lat': '46.3497', 'lon': '48.0408'},
    'Владикавказ': {'lat': '46.3497', 'lon': '48.0408'},
    'Владимир': {'lat': '46.3497', 'lon': '48.0408'},
    'Волгоград': {'lat': '46.3497', 'lon': '48.0408'},
    'Волгодонск': {'lat': '46.3497', 'lon': '48.0408'},
    'Волжский': {'lat': '46.3497', 'lon': '48.0408'},
    'Вологда': {'lat': '46.3497', 'lon': '48.0408'},
    'Воронеж': {'lat': '46.3497', 'lon': '48.0408'},
    'Грозный': {'lat': '46.3497', 'lon': '48.0408'},
    'Дербент': {'lat': '46.3497', 'lon': '48.0408'},
    'Дзержинск': {'lat': '46.3497', 'lon': '48.0408'},
    'Димитровград': {'lat': '46.3497', 'lon': '48.0408'},
    'Долгопрудный': {'lat': '46.3497', 'lon': '48.0408'},
    'Домодедово': {'lat': '46.3497', 'lon': '48.0408'},
    'Евпатория': {'lat': '46.3497', 'lon': '48.0408'},
    'Екатеринбург': {'lat': '46.3497', 'lon': '48.0408'},
    'Елец': {'lat': '46.3497', 'lon': '48.0408'},
    'Ессентуки': {'lat': '46.3497', 'lon': '48.0408'},
    'Железногорск': {'lat': '46.3497', 'lon': '48.0408'},
    'Жуковский': {'lat': '55.5953', 'lon': '38.1203'},
    'Зеленодольск': {'lat': '55.8438', 'lon': '48.5178'},
    'Златоуст': {'lat': '55.1711', 'lon': '59.6508'},
    'Иваново': {'lat': '56.9972', 'lon': '40.9714'},
    'Ижевск': {'lat': '56.8498', 'lon': '53.2045'},
    'Иркутск': {'lat': '52.2978', 'lon': '104.296'},
    'Йошкар-Ола': {'lat': '56.6388', 'lon': '47.8908'},
    'Казань': {'lat': '55.7887', 'lon': '49.1221'},
    'Калининград': {'lat': '54.7065', 'lon': '20.511'},
    'Калуга': {'lat': '54.5293', 'lon': '36.2754'},
    'Каменск-Уральский': {'lat': '56.4185', 'lon': '61.9329'},
    'Камышин': {'lat': '50.0983', 'lon': '45.416'},
    'Каспийск': {'lat': '42.8816', 'lon': '47.6392'},
    'Кемерово': {'lat': '55.3333', 'lon': '86.0833'},
    'Керчь': {'lat': '45.3531', 'lon': '36.4743'},
    'Киров': {'lat': '58.5966', 'lon': '49.6601'},
    'Кисловодск': {'lat': '43.9133', 'lon': '42.7208'},
    'Ковров': {'lat': '56.3572', 'lon': '41.3192'},
    'Коломна': {'lat': '55.0794', 'lon': '38.7783'},
    'Комсомольск-на-Амуре': {'lat': '50.5503', 'lon': '137.01'},
    'Копейск': {'lat': '55.1172', 'lon': '61.6282'},
    'Королёв': {'lat': '55.9142', 'lon': '37.8256'},
    'Кострома': {'lat': '57.7665', 'lon': '40.9269'},
    'Красногорск': {'lat': '55.8204', 'lon': '37.3302'},
    'Краснодар': {'lat': '45.0448', 'lon': '38.976'},
    'Красноярск': {'lat': '56.0184', 'lon': '92.8672'},
    'Курган': {'lat': '55.45', 'lon': '65.3333'},
    'Курск': {'lat': '51.7373', 'lon': '36.1874'},
    'Кызыл': {'lat': '51.7147', 'lon': '94.4534'},
    'Липецк': {'lat': '52.6031', 'lon': '39.5708'},
    'Люберцы': {'lat': '55.6772', 'lon': '37.8932'},
    'Магнитогорск': {'lat': '53.4186', 'lon': '59.0472'},
    'Майкоп': {'lat': '44.6078', 'lon': '40.1058'},
    'Махачкала': {'lat': '42.9764', 'lon': '47.5024'},
    'Миасс': {'lat': '55.045', 'lon': '60.1083'},
    'Мурманск': {'lat': '68.9792', 'lon': '33.0925'},
    'Муром': {'lat': '55.575', 'lon': '42.0426'},
    'Мытищи': {'lat': '55.9116', 'lon': '37.7308'},
    'Набережные Челны': {'lat': '55.7254', 'lon': '52.4112'},
    'Назрань': {'lat': '43.226', 'lon': '44.7732'},
    'Нальчик': {'lat': '43.4981', 'lon': '43.6189'},
    'Находка': {'lat': '42.8138', 'lon': '132.873'},
    'Невинномысск': {'lat': '44.6333', 'lon': '41.9444'},
    'Нефтекамск': {'lat': '56.092', 'lon': '54.2661'},
    'Нефтеюганск': {'lat': '61.0998', 'lon': '72.6035'},
    'Нижневартовск': {'lat': '60.9344', 'lon': '76.5531'},
    'Нижнекамск': {'lat': '55.6366', 'lon': '51.8245'},
    'Нижний Новгород': {'lat': '56.3287', 'lon': '44.002'},
    'Нижний Тагил': {'lat': '57.9194', 'lon': '59.965'},
    'Новокузнецк': {'lat': '53.7557', 'lon': '87.1099'},
    'Новомосковск': {'lat': '54.0105', 'lon': '38.2846'},
    'Новороссийск': {'lat': '44.7244', 'lon': '37.7675'},
    'Новосибирск': {'lat': '55.0415', 'lon': '82.9346'},
    'Новочебоксарск': {'lat': '56.111', 'lon': '47.4776'},
    'Новочеркасск': {'lat': '47.421', 'lon': '40.0919'},
    'Новошахтинск': {'lat': '47.7604', 'lon': '39.9333'},
    'Новый Уренгой': {'lat': '66.0833', 'lon': '76.6333'},
    'Ногинск': {'lat': '55.8665', 'lon': '38.4438'},
    'Норильск': {'lat': '69.3535', 'lon': '88.2027'},
    'Ноябрьск': {'lat': '63.1931', 'lon': '75.4373'},
    'Обнинск': {'lat': '55.0968', 'lon': '36.6101'},
    'Одинцово': {'lat': '55.678', 'lon': '37.2777'},
    'Октябрьский': {'lat': '54.4815', 'lon': '53.471'},
    'Омск': {'lat': '54.9924', 'lon': '73.3686'},
    'Орёл': {'lat': '52.9651', 'lon': '36.0785'},
    'Оренбург': {'lat': '51.7727', 'lon': '55.0988'},
    'Орехово-Зуево': {'lat': '55.8067', 'lon': '38.9618'},
    'Орск': {'lat': '51.2049', 'lon': '58.5668'},
    'Первоуральск': {'lat': '56.9053', 'lon': '59.9436'},
    'Пермь': {'lat': '58.0105', 'lon': '56.2502'},
    'Петрозаводск': {'lat': '61.7849', 'lon': '34.3469'},
    'Петропавловск-Камчатский': {'lat': '53.0444', 'lon': '158.651'},
    'Подольск': {'lat': '55.4242', 'lon': '37.5547'},
    'Прокопьевск': {'lat': '53.9059', 'lon': '86.719'},
    'Псков': {'lat': '57.8136', 'lon': '28.3496'},
    'Пушкино': {'lat': '56.0172', 'lon': '37.8667'},
    'Пятигорск': {'lat': '44.0486', 'lon': '43.0594'},
    'Раменское': {'lat': '55.5669', 'lon': '38.2303'},
    'Реутов': {'lat': '55.7611', 'lon': '37.8575'},
    'Ростов-на-Дону': {'lat': '47.2313', 'lon': '39.7233'},
    'Рубцовск': {'lat': '51.5147', 'lon': '81.2061'},
    'Рыбинск': {'lat': '58.0446', 'lon': '38.8426'},
    'Рязань': {'lat': '54.6269', 'lon': '39.6916'},
    'Салават': {'lat': '53.3837', 'lon': '55.9077'},
    'Самара': {'lat': '53.2001', 'lon': '50.15'},
    'Саранск': {'lat': '54.1838', 'lon': '45.1749'},
    'Саратов': {'lat': '51.5406', 'lon': '46.0086'},
    'Севастополь': {'lat': '44.5888', 'lon': '33.5224'},
    'Северодвинск': {'lat': '64.5635', 'lon': '39.8302'},
    'Северск': {'lat': '56.6006', 'lon': '84.8864'},
    'Сергиев Посад': {'lat': '56.3', 'lon': '38.1333'},
    'Серпухов': {'lat': '54.9158', 'lon': '37.4111'},
    'Симферополь': {'lat': '44.9572', 'lon': '34.1108'},
    'Смоленск': {'lat': '54.7818', 'lon': '32.0401'},
    'Сочи': {'lat': '43.5992', 'lon': '39.7257'},
    'Ставрополь': {'lat': '45.0428', 'lon': '41.9734'},
    'Старый Оскол': {'lat': '51.2967', 'lon': '37.8417'},
    'Стерлитамак': {'lat': '53.6246', 'lon': '55.9501'},
    'Сургут': {'lat': '61.25', 'lon': '73.4167'},
    'Сызрань': {'lat': '53.1585', 'lon': '48.4681'},
    'Сыктывкар': {'lat': '61.6764', 'lon': '50.8099'},
    'Таганрог': {'lat': '47.2362', 'lon': '38.8969'},
    'Тамбов': {'lat': '52.7317', 'lon': '41.4433'},
    'Тверь': {'lat': '56.8584', 'lon': '35.9006'},
    'Тольятти': {'lat': '53.5303', 'lon': '49.3461'},
    'Томск': {'lat': '56.4977', 'lon': '84.9744'},
    'Тула': {'lat': '54.1961', 'lon': '37.6182'},
    'Тюмень': {'lat': '57.1522', 'lon': '65.5272'},
    'Улан-Удэ	': {'lat': '51.8272', 'lon': '107.606'},
    'Ульяновск': {'lat': '54.3282', 'lon': '48.3866'},
    'Уссурийск': {'lat': '43.8029', 'lon': '131.946'},
    'Уфа': {'lat': '54.7431', 'lon': '55.9678'},
    'Хабаровск': {'lat': '48.4827', 'lon': '135.084'},
    'Ханты-Мансийск': {'lat': '61.0042', 'lon': '69.0019'},
    'Хасавюрт': {'lat': '43.2509', 'lon': '46.5877'},
    'Химки': {'lat': '55.897', 'lon': '37.4297'},
    'Чебоксары': {'lat': '56.1322', 'lon': '47.2519'},
    'Челябинск': {'lat': '55.154', 'lon': '61.4291'},
    'Череповец': {'lat': '59.1333', 'lon': '37.9'},
    'Черкесск': {'lat': '44.2233', 'lon': '42.0578'},
    'Чита': {'lat': '52.0317', 'lon': '113.501'},
    'Шахты': {'lat': '47.7091', 'lon': '40.2144'},
    'Щёлково': {'lat': '55.925', 'lon': '37.9722'},
    'Электросталь': {'lat': '55.7896', 'lon': '38.4467'},
    'Элиста': {'lat': '46.3078', 'lon': '44.2558'},
    'Энгельс': {'lat': '51.4839', 'lon': '46.1053'},
    'Южно-Сахалинск': {'lat': '46.9541', 'lon': '142.736'},
    'Якутск': {'lat': '62.0339', 'lon': '129.733'},
    'Ярославль': {'lat': '57.6299', 'lon': '39.8737'},
}

direction = {
    'nw': 'северо-западное',
    'n': 'северное',
    'ne': 'северо-восточное',
    'e': 'восточное',
    'se': 'юго-восточное',
    's': 'южное',
    'sw': 'юго-западное',
    'w': 'западное',
    'c': 'штиль',
}

precipitation = {
    'clear': 'ясно',
    'partly-cloudy': 'малооблачно',
    'cloudy': 'облачно с прояснениями',
    'overcast': 'пасмурно',
    'drizzle': 'морось',
    'light-rain': ' небольшой дождь',
    'rain': 'дождь',
    'moderate-rain': 'умеренно сильный дождь',
    'heavy-rain': 'сильный дождь',
    'continuous-heavy-rain': 'длительный сильный дождь',
    'showers': 'ливень',
    'wet-snow': 'дождь со снегом',
    'light-snow': 'небольшой снег',
    'snow': 'снег',
    'snow-showers': 'снегопад',
    'hail': 'град',
    'thunderstorm': 'гроза',
    'thunderstorm-with-rain': 'дождь с грозой',
    'thunderstorm-with-hail': 'гроза с градом'
}


class MyStates(StatesGroup):
    """
        Класс состояний

        city: состояние 'пользователь ввёл город отслеживания'
        count_day: состояние 'пользователь ввёл дни отслеживания'
    """
    city: State = State()
    count_day: State = State()


def city_search(city) -> tuple[str, str]:
    """
        Функция поиска широты и долготы города запроса.
        :param city: город запроса
        :return: lat, lon
    """
    lat = cities[city]['lat']
    lon = cities[city]['lon']

    return lat, lon


def direction_search(wind_dir) -> str:
    """
        Функция перевода направления ветра.
        :param wind_dir: направление ветра
        :return: direction[wind_dir]
    """
    return direction[wind_dir]


def precipitation_search(condition) -> str:
    """
        Функция перевода осадков.
        :param wind_dir: осадки
        :return: precipitation[condition]
    """
    return precipitation[condition]
